atuaizando com configs
